* TODO Learn enough CSS [50%]
  :LOGBOOK:
  CLOCK: [2017-07-25 Tue 21:08]--[2017-07-25 Tue 21:33] =>  0:25
  CLOCK: [2017-07-25 Tue 20:29]--[2017-07-25 Tue 20:54] =>  0:25
  CLOCK: [2017-07-24 Mon 20:37]--[2017-07-24 Mon 21:02] =>  0:25
  CLOCK: [2017-07-23 Sun 12:14]--[2017-07-23 Sun 12:39] =>  0:25
  CLOCK: [2017-07-22 Sat 22:38]--[2017-07-22 Sat 23:03] =>  0:25
  CLOCK: [2017-07-19 Wed 22:37]--[2017-07-19 Wed 23:02] =>  0:25
  :END:
  - xdg-open <filename>
** DONE Intro [100%]
   CLOSED: [2017-07-11 Tue 01:13]
*** DONE front end dev
    CLOSED: [2017-07-09 Sun 22:57]
*** DONE Overview
    CLOSED: [2017-07-09 Sun 23:15]
*** DONE Sample site setup
    CLOSED: [2017-07-10 Mon 22:28]
*** DONE Start
    CLOSED: [2017-07-10 Mon 23:33]
*** DONE Selectors
    CLOSED: [2017-07-11 Tue 01:12]
** DONE Style [100%]
   CLOSED: [2017-07-11 Tue 23:25]
*** DONE Naming
    CLOSED: [2017-07-11 Tue 21:54]
*** DONE When/why
    CLOSED: [2017-07-11 Tue 22:05]
*** DONE priority
    CLOSED: [2017-07-11 Tue 22:32]
*** DONE Good citizen
    CLOSED: [2017-07-11 Tue 23:05]
    - modular - styles should only affect things inside of modules rather than site-wide.
    - aim to keep it simple
    - multiple classes when things need to be slightly different bc context
    - use id only if absolutely necessary - default to classes
    - rule of thumb: three selectors maximum
    - make good decisions early to avoid work later
** DONE Values: Color, size [100%]
   CLOSED: [2017-07-23 Sun 13:11]
*** DONE Color
    CLOSED: [2017-07-19 Wed 22:36]
   - rgba transparency needs leading zero eg 0.5
*** DONE intro sizing
    CLOSED: [2017-07-19 Wed 22:45]
*** DONE pixels
    CLOSED: [2017-07-19 Wed 22:53]
    - some places work better with absolute sizing eg. margins and padding
*** DONE percentages
    CLOSED: [2017-07-19 Wed 23:04]
*** DONE em
    - em mainly for font
    CLOSED: [2017-07-22 Sat 22:53]
*** DONE rem
    CLOSED: [2017-07-23 Sun 12:25]
    - make modular code by setting top level of chunk at rem  unit and using em for children
*** DONE vw vh
    CLOSED: [2017-07-23 Sun 13:00]
    - viewport height, viewport width
    - each is 1% :: 100vw equals full width
    - should use different setups for desktop, mobile, etc.
*** DONE pleasing fonts
    CLOSED: [2017-07-23 Sun 13:11]
** DONE Box Model [100%]
   CLOSED: [2017-07-31 Mon 21:49]
*** DONE inline vs block
    CLOSED: [2017-07-24 Mon 20:49]
*** DONE margins padding borders
    CLOSED: [2017-07-24 Mon 21:02]
    - use border-box to add padding without changing overall size (eg putting something under header)
*** DONE Floats
    CLOSED: [2017-07-25 Tue 20:56]
*** DONE Overflow style
    CLOSED: [2017-07-25 Tue 21:16]
    - Hidden :: if wrapper has defined height cuts off everything past, otherwise extends wrapper to hold content
    - Visible :: allows content to spill past wrapper, with no defined size will extend as above
    - Scroll :: Sets up a scroll bar inside wrapper
*** DONE Inline Block
    CLOSED: [2017-07-25 Tue 21:24]
    - can make inline lists eg navbar
*** DONE Box Margins
    CLOSED: [2017-07-27 Thu 20:00]
    - you are at listing 84 :: figure out why the .bio-box h3 is only applied to one h3
*** DONE Padding - Chairs
    CLOSED: [2017-07-27 Thu 20:03]
*** DONE Border fun
    CLOSED: [2017-07-28 Fri 04:28]
** DONE Laying it all out [100%]
   CLOSED: [2017-08-22 Tue 23:18]
*** DONE basics
    CLOSED: [2017-08-01 Tue 23:12]
*** DONE Jekyll
    CLOSED: [2017-08-01 Tue 23:12]
    - jekyll serve --port (default 4000) change if you need more than one at once
    - auto generates _site folder from source files
*** DONE Layouts, includes, pages
    CLOSED: [2017-08-01 Tue 23:23]
    - front matter --- <metadata> ---
      - identifies layout as a template
*** DONE layout file
    CLOSED: [2017-08-07 Mon 19:44]
    ---
    layout: default
    ---
    - jekyll treats local directory as site eg localhost:4000/webpagename.html takes you to that page
*** DONE CSS file/reset
    CLOSED: [2017-08-16 Wed 22:35]
    - Use classes on semantic elements like header, nav, etc.
    - use includes to make things like reset, header, etc. portable/modular
    - Navigation and children
*** DONE includes intro
    CLOSED: [2017-08-16 Wed 22:35]
*** DONE CSS file/reset
    CLOSED: [2017-08-12 Sat 13:46]
*** DONE includes intro
    CLOSED: [2017-08-12 Sat 14:13]
    - logo goes at bottom of list bc otherwise the line height takes precedence and nav links go underneath on new line
    - portability is key, header sits in includes file, separate from head, all separate from css and content
*** DONE advanced selector
    CLOSED: [2017-08-18 Fri 21:17]
**** Pseudo classes
     - :hover :: styles what happens when user rolls over elements
     - :active :: styles what happens on click
     - :visited :: styles what link looks like if user has visited linked page
**** Sibling selectors
      - + :: select only first sibling (h2 + p styles first p after h2)
      - ~ :: select all siblings (h2 ~ p styles all p immediately following h2)
**** Child selectors
     - first-child :: styles only first child of parent element
     - last-child :: styles only last child of parent element
*** DONE positioning
    CLOSED: [2017-08-22 Tue 19:27]
**** Position styles
***** Static :: Default positioning
      - Respects content flow
      - Can't be positioned outside natural position
      - Scrolls with content
***** Relative :: Like static but allows for directional styles
      -  Respects content flow / scrolls with content
      -  Can set z-index
      -  Allows absolutely positioned items to be contained within, as though the relatively positioned element were a separate canvas
***** Absolute :: Takes element out of document flow
      - Scrolls with content
      - Can set z-index
      - Ignores float
      - Positioned relative to next parent with position style other than static or to page if none
      - Needs dimensions, otherwise it will be the size of content within
***** Fixed :: Positions element at a specific place within the page
      - Can set z-index
      - Ignore floats
      - Needs dimensions, otherwise it will be the size of content within

*** DONE fixed header
    CLOSED: [2017-08-22 Tue 23:18]
    - position: fixed
    - high z-index so content scrolls underneath
    
*** DONE footer, includes in includes
    CLOSED: [2017-08-22 Tue 23:18]
    - footer much the same as header but much larger
    - use include to repeat nav content, doesnt matter that footer is an include
** TODO Page templates and frontmatter [25%] 
*** DONE Template content
    CLOSED: [2017-08-26 Sat 18:11]
    - Use {{ content }} to insert whatever page the user visits into layout (eg index.html)
*** TODO No place like home
    - big splash hero (border-box, 100vh height, 10vh padding (height of header), border-size: cover (this one was weird, redownload img if theres problem
    - 
*** TODO More advanced selectors
*** TODO Other pages, other folders
** TODO Specialty layout - flexbox [%]
** TODO adding a blog [%]
** TODO Mobile media queries [%]
** TODO more little touches [%]

* TODO Learn Enough Ruby [%]
  - Do before catching up on ODIN?

* TODO Rails Tutorial [%]
  -use this but make your own site
  -Hart.io?
  -Make logo and all of that
  -styling with css
  -put everything together and make this a serious things
  -plan for it to be your portfolio/business site

* TODO Viking [%]
** TODO Front End
*** TODO HTML/CSS
**** TODO Resume Finish HTML
**** TODO CSS Garden
**** TODO Lorem Ipsum Blog
**** TODO Facebook CSS projects
*** TODO SASS
*** TODO Bootstrap
** TODO Javascript
** TODO Ruby
** TODO Getting hired phase 1

* TODO ODIN [0%]
** Clean up odds n ends
** TODO Rails
*** TODO Forms project
*** TODO Members only
*** TODO Associations
*** TODO Advanced Associations
*** TODO Advanced Forms
*** TODO APIs
*** TODO Confirmation Email
*** TODO Final Project
** TODO HTML/CSS
*** TODO Embedding img/vid
*** TODO HTML Forms
*** TODO Position/Float elements
*** TODO Backgrounds/gradients
*** TODO Design teardown
*** TODO Responsive design
*** TODO Bootstrap
*** TODO Grid Framework
** TODO Javascript/JQUERY
*** TODO Calculator
*** TODO Manipulating DOM
*** TODO Jquery and DOM
*** TODO Image Carousel
*** TODO Tic Tac Toe
*** TODO Minesweeper
*** TODO Callbacks
*** TODO Games with canvas
*** TODO Validating with Jquery
*** TODO Infinite scroll/submitting form with AJAX
*** TODO Google maps
*** TODO Wheres waldo
*** TODO Single Page websites angular/backbone
*** TODO Node.js
*** TODO Final
** TODO Getting Hired
*** TODO Website
*** TODO Resume

* TODO FreeCodeCamp [%]
** TODO Check it out - good resume builder

* TODO Codewars
** TODO Try making a habit of one or two each day in the morning
